tutorials/multiRegion/film/hotBoxes/system/fluid/subsetMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      subsetMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

zone
{
    type        box;
    select      outside;
    boxes
    (
        (0.4 0.1 0.1) (0.6 0.3 0.3)
        (0.4 0.1 0.4) (0.6 0.3 0.6)
        (0.4 0.4 0.1) (0.6 0.6 0.3)
        (0.4 0.4 0.4) (0.6 0.6 0.6)
    );
}

patch   film;

// ************************************************************************* //
